app/views/admin/events/_form.html.slim

SELECT "categories".* FROM "categories"
---
  = f.label :category_id
  = f.select :category_id, Category.all.map{ |c| [c.name, c.id] }, {}, class: 'form-control'
.form-group