app/views/admin/events/index.html.slim

  p
    = select_tag :event_status, options_for_select(Event::STATUS.map{ |s| [t(s, scope: 'event.status'), s]}), class: 'form-control'
---
SELECT "events".* FROM "events"