app/controllers/admin/events_controller.rb

  def index
    @events = Event.rank(:row_order).all
---
SELECT "events".* FROM "events"

  def show
    @event = Event.find_by_friendly_id!(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "a8fbeff7-7961-4e2b-8ce9-947796c629a3"], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "imtinge"], ["description", "impinge "], ["created_at", 2017-08-13 06:08:28 UTC], ["updated_at", 2017-08-13 06:08:28 UTC]]

  def edit
    @event = Event.find_by_friendly_id!(params[:id])
    @event.tickets.build if @event.tickets.empty?
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "a8fbeff7-7961-4e2b-8ce9-947796c629a3"], ["LIMIT", 1]]
SELECT  1 AS one FROM "tickets" WHERE "tickets"."event_id" = ? LIMIT ?  [["event_id", 3], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ?  [["event_id", 3]]

  def update
    @event = Event.find_by_friendly_id!(params[:id])

    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "a8fbeff7-7961-4e2b-8ce9-947796c629a3"], ["LIMIT", 1]]
UPDATE "events" SET "friendly_id" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["friendly_id", "没有你"], ["updated_at", 2017-08-13 06:27:25 UTC], ["id", 2]]

  def destroy
    @event = Event.find_by_friendly_id!(params[:id])
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "没有你"], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]