app/controllers/admin/event_tickets_controller.rb

  def create
    @ticket = @event.tickets.new(ticket_params)
    if @ticket.save
---
INSERT INTO "tickets" ("event_id", "name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 3], ["name", "3"], ["price", 2], ["created_at", 2017-08-13 14:33:25 UTC], ["updated_at", 2017-08-13 14:33:25 UTC]]

  def edit
    @ticket = @event.tickets.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? AND "tickets"."id" = ? LIMIT ?  [["event_id", 3], ["id", 6], ["LIMIT", 1]]

  def update
    @ticket = @event.tickets.find(params[:id])

    if @ticket.update(ticket_params)
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? AND "tickets"."id" = ? LIMIT ?  [["event_id", 3], ["id", 6], ["LIMIT", 1]]
UPDATE "tickets" SET "description" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["description", "3"], ["updated_at", 2017-08-13 14:35:58 UTC], ["id", 6]]

  def destroy
    @ticket = @event.tickets.find(params[:id])
    @ticket.destroy
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? AND "tickets"."id" = ? LIMIT ?  [["event_id", 3], ["id", 5], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 5]]

  def find_event
    @event = Event.find_by_friendly_id!(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "sukara"], ["LIMIT", 1]]