app/controllers/admin/users_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
---
  def index
    @users = User.includes(:groups).all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "robyn1.bode@blanda.org"], ["updated_at", 2017-08-13 12:34:22 UTC], ["id", 2]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)