app/controllers/admin/user_profiles_controller.rb

UPDATE "profiles" SET "legal_name" = ?, "birthday" = ?, "location" = ?, "education" = ?, "occupation" = ?, "bio" = ?, "specialty" = ?, "updated_at" = ? WHERE "profiles"."id" = ?
---
  def update
    if @profile.update(profile_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", 2017-08-13 13:17:58 UTC], ["updated_at", 2017-08-13 13:17:58 UTC]]
---
  def find_user_and_profile
    @user = User.find(params[:user_id])
    @profile = @user.profile || @user.create_profile