app/controllers/events_controller.rb

  def index
    # @events = Event.rank(:row_order).all
    @events = Event.only_public.rank(:row_order).all
---
SELECT "events".* FROM "events"

  def show
    # @event = Event.find_by_friendly_id!(params[:id])
    @event = Event.only_available.find_by_friendly_id!(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "a8fbeff7-7961-4e2b-8ce9-947796c629a3"], ["LIMIT", 1]]