app/controllers/users_controller.rb

UPDATE "users" SET "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["time_zone", "Beijing"], ["updated_at", 2017-08-13 07:34:59 UTC], ["id", 1]]
---
  def update
    if @user.update(user_params)