app/views/admin/users/edit.html.slim

    = f.label :group_ids
    = f.select :group_ids, Group.all.map{ |g| [g.name, g.id] }, {}, multiple: true, class: 'form-control'
  .form-group
---
SELECT "groups".* FROM "groups"