app/views/admin/users/index.html.slim

        td
          - user.groups.each do |g|
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]